//주석
//범위잡고 ctrl+/ = 한줄주석 단축기
/*범위잡고 ctrl+shift+/=
여러줄 주석 단축기*/






package Day01;

/*package:패키지 이름이 표시되는키워드
package 패키기명:현재 소스 파일이 위치한 패키지명*/

public class Ex1 { //class시작
	
	int 변수=10; //클래스 안에서 코드 작성 가능
	//2.화면 실행 되는 코드는 main함수 {} 안에서만 코드를 작성한다.!!!!
		//main함수: 메인스레드 가지고있는 함수
			//스레드:코드를 읽어드리는 흐름 단위
	
		//m 입력후 ctrl + 스페이스바 => 엔터

	public static void main(String[] args) {
		//3. 출력: syso 입력후 ctrl + 스페이스바 => 엔터
		System.out.println("안녕 자바"); //콘솔로그와 같다.메인 안에서 써야함
		
	}
	
	
	

}//class 끝
/*
 * 
 * public:사용범위뜻 [프로젝트 내 모든곳 사용]
 *   class: 클래스 선언 사용되는 키워드
 * Ex1:클래스명[아무거나]영문/첫글자 영대문자
 * { }:클래스의 시작 s끝 e
 */

/*
 * 자바 100%객체지향언어
 * 클래스 : 객체지향 생성하기 위한 미리 정의된 틀/설계도 [붕어빵틀]
 * 객체 : 클래스 기반으로 만들어진 식별 가능한 메모리/변수 [붕어빵1,붕어빵2,붕어빵3]
 * 객체지향 [oop]:객체들을 모아서 만든 프로그램 [레고]
 * 
 */


